package com.arr;

/**
 * date:  2017/4/16 19:09 <br>
 * description: 三位数组 <br>
 *     int[][][] values = {{{1,2},{1,3},{1,4},{1,6}},
 *                          {{2,2},{2,3},{2,4},{2,6}},
 *                          {{3,2},{3,3},{3,4},{3,6}},
 *                          {{4,2},{4,3},{4,4},{4,6}}
 *                          };
 */
public class TripleArr {
    public static void main(String[] args) {
        int[][][] values = {
                {
                    {1,1,1},{1,2,3},{1,3,4},{1,4,5}
                },
                {
                    {2,2},{2,3},{2,4},{2,6}
                },
                {
                    {3,2},{3,3},{3,4},{3,6}
                },
                {
                    {4,2},{4,3},{4,4},{4,6}
                }
         };
        System.out.println("Value:2层3行2列:" + values[1][2][1]);
    }
}
